// Напишите программу, которая получает на вход два числа и выводит большее из них.

public class Main {
public static void main(String[] args) {

    int num1 = 10;
    int num2 = 15;

    if (num1 > num2) {
    System.out.println(num1);
    } else {
    System.out.println(num2);
}
}
}

/*
Эта программа использует логический оператор > для сравнения двух чисел. 
Если первое число больше второго, то программа выведет первое число, а если второе число больше первого, то программа выведет второе число.
*/
