/*
Создайте три переменные num1, num2 и num3 типа double и присвойте им любые значения. 
Затем создайте переменную average и вычислите среднее значение этих трех чисел.
*/

public class Main {
public static void main(String[] args) {

    double num1 = 50;
    double num2 = 40;
    double num3 = 20;
    
    double avg = (num1 + num2 + num3) / 3;
  
    System.out.print("Ответ: " +avg);
}
}

/*
В данном примере создаются три переменные num1 , num2 и num3 типа double и им присваиваются значения 50, 40 и 20 соответственно. 
Затем переменная average вычисляет среднее значение этих трех чисел, используя операцию деления на 3. 
В конце программа выводит значение average с помощью метода print().
*/
