/* 
Создайте переменную age типа int и присвойте ей значение вашего возраста. Напишите условный оператор if, который проверяет, является ли значение age больше или равно 18. 
Если это так, выведите "Вы совершеннолетний", в противном случае выведите "Вы несовершеннолетний".
*/

public class Main {
public static void main(String[] args) {
     
    int age = 28; // Замените значение на свой возраст
     
    if(age >= 18) {
    System.out.println("Вы совершеннолетний");
    } else {
    System.out.println("Вы несовершеннолетний");
}
}
}

/* 
В данном примере создается переменная age типа int и присваивается значение 28. 
Затем условный оператор if проверяет, является ли значение age больше или равно 18. 
Если это условие истинно, то выводится сообщение "Вы совершеннолетний". В противном случае выводится сообщение "Вы несовершеннолетний".
*/
