// Напишите программу, которая получает на вход два числа и выводит большее из них. Используйте логические операторы в вашем условии.

public class Main {
public static void main(String[] args) {

    int num1 = 10;
    int num2 = 15;

    if (num1 > num2) {
    System.out.println(num1);
    } else {
    System.out.println(num2);
}
}
}
