// ВАЖНО! Если вы пишете команду System.out.println() несколько раз, каждый раз переданный в нее текст будет выводиться с новой строки. Если System.out.print(), текст будет выводиться на той же строке

// Напишите программу, которая выводит на экран информацию о вас (или выдуманном персонаже) в три строчки:

public class Main {
public static void main(String[] args) {
      
    System.out.println("Здравствуйте! Меня зовут Сергей"); 
    System.out.print("Мне ");
    System.out.print(10+18);
    System.out.println(" лет");
    System.out.println("У моего жизненного пути есть сердце.");
}
}
