// Создайте три переменные num1, num2 и num3 типа double и присвойте им любые значения. Затем создайте переменную average и вычислите среднее значение этих трех чисел.

public class Main {
public static void main(String[] args) {

    double num1 = 50;
    double num2 = 40;
    double num3 = 0;
    double avg = num1 + num2 + num3;
  
    System.out.print("К оплате: " +avg);
    System.out.print(" Euro");
}
}
